#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/loktf/terraform/runs/run-xAZpjRo1WC7Ns29X

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG]
random_id.randomId: Refreshing state... [id=mYvuJ1trbGI]
azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/publicIPAddresses/myPublicIP]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/virtualNetworks/vnet-tf]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/virtualNetworks/vnet-tf/subnets/subnet01]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkInterfaces/myNIC]
azurerm_network_interface_security_group_association.ngsa: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkInterfaces/myNIC|/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.myterraformvm will be created
  + resource "azurerm_linux_virtual_machine" "myterraformvm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = "myvm"
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "TFCloudVM"
      + network_interface_ids           = [
          + "/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkInterfaces/myNIC",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "TFCloudRG"
      + size                            = "Standard_B1s"
      + tags                            = {
          + "environment" = "Terraform Cloud Demo"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "myOsDisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @lokpavan03, Action: `pull_request`*